# №1
a=int(input("введите делимое "))
b=int(input("введите делитель "))
if(b!=0):
   print(a/b)
else:
   print("на ноль делить нельзя")

# №2
x = input()
x = float(x)
if x > 20:
   b = x * 0.35 
   a = x - b
   print("размер скидки:",b)
   print("итоговая цена:",a)
else:
   a = x
   b = 0
   print("размер скидки:",b)
   print("итоговая цена:",a)

# №3
a = int(input())
m = ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь']
if 1 <= a <= 12:
    if 9 <= a < 12:
        print(f'это {m[a]}, осень')
    elif 3 <= a < 6:
        print(f'это {m[a]}, весна')
    elif 6 <= a < 9:
        print(f'это {m[a]}, лето')
    else:
        print(f'это {m[a]}, зима')
else:
    print('такого месяца нет(')
